The
issue
resolved
correctly
It
took
research
end
still
billed
incorrectly
Just
one
order
changed
billing
without
authorization
main
entity
nothing
customer
service
person
way
managed
Susan
provides
efficient
timely
reps
fault
hands
fix
issues
Xerox
yet
completed
fixing
invoice
started
June
request
update
bill
address
see
prior
comment
Can
split
difference
since
readings
taken
guys
notes
really
use
machine
clicks
charging
states
reading
moved
facility
continued
fact
testing
etc
get
us
set
We
could
print
due
printing
used
another
finally
July
pm
correct
press
afternoon
That
done
starting
number
month
sign
sheet
adjust
log
For
large
color
know
previous
written
charge
never
received
quote
hate
dealing
emails
phone
call
menu
hell
giant
turn
want
company
This
whole
thing
problem
needed
sent
provided
arrived
given
send
back
No
ever
able
explain
many
ordered
give
refund
Overall
positive
experience
trying
resolve
February
hence
final
question
spoken
multiple
individuals
Ms
Ronal
ownership
investigated
situation
accurately
pleasure
deal
AND
TO
WITH
THANK
YOU
like
last
week
department
messed
Your
first
representative
spoke
polite
helpful
amazing
concerns
credit
cause
concern
active
level
upsetting
However
Sarah
de
job
cleaning
long
standing
mess
Her
follow
well
unprofessional
Need
talk
someone
position
Please
provide
contact
terrible
already
wasted
much
time
providing
details
review
requested
serial
new
email
else
called
help
whats
unhelpful
dealt
business
comments
endless
paperwork
years
change
WorkCentre
And
seems
accomplished
even
though
told
repairs
keeps
getting
owner
late
charges
When
representatives
doesnt
actually
work
response
got
changing
makes
absolutely
sense
cant
anyone
tell
supposed
mean
per
conversation
cannot
account
two
different
legal
however
past
effective
wish
equipment
wasnt
good
Im
tired
horrible
feel
check
every
dealings
made
wonder
run
bunch
My
inquiry
regarding
sales
tax
invoices
agreements
click
came
said
mandatory
Ill
perhaps
somebody
leases
NOT
charged
waiting
report
need
important
receive
would
preferred
day
ok
Without
instructions
located
add
information
easy
find
Thank
Initially
believe
addressed
contacted
sure
She
screen
changes
assure
Very
happy
effort
case
closed
Great
Job
days
longer
professional
policies
Ive
always
part
sudden
going
techs
Once
limited
nice
letter
asking
terms
buy
lease
second
weve
reason
gone
Support
Service
Thanks
enough
You
folks
contract
lady
ext
assured
care
bills
inquiries
Then
January
meter
reads
Get
act
together
stop
hoping
wont
pay
attention
guessing
hope
something
owe
money
Terri
excellent
resolving
thanks
quickly
pushed
rep
responsibility
agreement
support
extremely
understanding
Resolved
logged
closure
notification
included
There
needing
credits
In
addition
applied
open
great
quick
resolution
copy
Purchase
Order
All
communication
via
Would
faster
around
submitting
requests
Jose
David
working
Billing
nearly
impossible
understand
explained
story
TWICE
Second
pretty
idea
talking
confidence
team
basically
wrong
paying
based
Invoice
Customer
Which
far
NO
AP
Specialist
numbers
feeling
ran
asked
dispute
fee
speak
decided
line
EXACT
gain
obviously
broken
process
promptly
looks
double
taxed
non
memo
original
revised
price
addressing
expeditious
manner
Still
toner
cartridge
purchased
online
supply
store
defective
After
calls
advised
solution
card
weeks
appeared
difficult
impressed
accepted
less
hours
Keep
appears
xerox
inform
make
invoicing
early
termination
type
refers
term
agreed
removed
hard
certainly
answers
local
dealer
buyout
considered
matter
saying
answer
go
ask
sr
handled
efficiently
Fast
Appreciate
supporting
Thankyou
take
bit
passing
buck
appreciate
speedy
claim
National
Park
staples
claiming
connected
exempt
supplies
involved
issued
condescending
responses
severe
communicate
Guatemala
simple
explanation
proper
procedure
put
ignored
Now
state
reference
dont
referenced
stated
monthly
annual
maintenance
English
clearly
Regarding
Fisher
name
Everything
fine
Credit
processed
Inquiry
ETA
pleased
remove
orders
placed
Sales
sending
Form
submitted
isnt
mine
Have
corrections
twice
corrected
solved
Requested
appreciated
Barbara
Lang
Services
skills
signed
returned
clue
engaged
incorrect
dept
forwarded
Closure
Notification
Request
mailed
stating
assignment
By
Another
rebill
SR
date
promised
wait
If
close
Luisa
amount
spent
unable
UPS
pickup
items
credited
reaching
clarification
worked
correction
havent
shipping
label
return
within
seen
went
beyond
picked
agent
professionally
thank
problems
handling
cancelation
expire
thought
continue
copier
turnaround
prompt
assistance
greatly
CN
Took
names
tried
emailed
metered
Our
install
seem
recall
please
considering
caused
settled
reply
Lynne
fiscal
year
Allan
PO
Accounts
wants
paid
exist
system
First
AGUILAR
looking
status
list
copies
Rhodes
payment
also
future
forward
Pharmaceuticals
individual
deals
reached
although
hear
everyone
Is
willing
continues
POs
causes
delay
seeking
originally
Problem
fully
seemed
found
today
downtime
amounts
City
Trying
place
showing
helped
replacement
Format
Printer
Mr
Morales
calling
questions
cancellation
pick
try
extra
rent
awaiting
clarify
recent
concerning
renewing
numerous
period
thru
come
sitting
hallway
everything
feet
picking
To
valid
agency
unacceptable
ready
removal
As
say
expired
justify
Procurement
Group
understands
expiration
dates
instead
prefer
extend
regardless
client
contracts
attempts
needs
cancelled
resubmitted
count
Sincerely
Officer
III
FIX
YOUR
misspelled
acknowledge
DID
several
times
giving
ALWAYS
known
spelled
people
think
nobody
Both
keep
months
satisfied
results
Be
kind
clients
offer
alternatives
Good
San
Juan
serious
complaint
management
responded
pass
message
passed
noted
beginning
December
kept
hold
communications
Javier
Carlos
base
August
excess
rigging
Nothing
Super
fast
courteous
balance
services
small
means
resources
focus
Manuel
responsive
County
customers
tool
purchase
behind
talked
insurance
least
doubt
Why
making
special
move
age
didnt
clear
apply
home
couldnt
anybody
website
password
THE
ISSUE
HAS
BEEN
RESOLVED
updated
happened
shows
info
reach
Totally
waste
Business
Administration
Ave
Suite
Puerto
Rico
Attn
Rodriguez
March
telling
renewed
disputed
cancel
therefore
automatically
cost
sourcing
cheaper
parts
must
reliability
otherwise
look
poor
uptime
technician
coming
onsite
bad
breaking
high
rate
maybe
resulting
result
currently
impact
directly
leave
better
fixed
soon
none
unit
requires
detail
available
might
responding
Apparently
blank
format
record
brought
rude
increase
Although
left
Number
Obviously
thats
belong
consulted
He
confirmed
Upon
reviewing
determine
generated
mentioned
AVE
FL
RM
JOB
real
urgent
priority
Cesar
patient
signatures
awhile
James
Daniel
moment
Monday
Lisa
Kathy
awesome
immediately
afford
Dennis
file
outstanding
hour
Excellent
occurred
redirected
cut
loop
sends
circles
DUNS
assigned
disappointed
Two
delayed
severely
Care
Resolution
Team
copied
Ana
Barrios
anything
Ericka
perfectly
Tuesday
right
Receiving
Invoices
normally
stopped
automatic
payments
group
taking
physical
avail
copiers
Also
Supplies
page
possible
input
hand
Really
handle
dated
taxes
takes
pull
Managed
requesting
regular
basis
access
usually
upset
specific
April
May
summary
associate
So
frustrating
Jossy
thorough
accurate
resolutions
simply
best
Glad
church
returning
Hopefully
Could
respond
heard
printer
Carol
Road
fax
ordering
timeconsuming
allow
Shipping
addresses
notice
old
creating
State
little
relations
machines
installed
error
Image
But
relationship
couple
dollars
zero
handing
ignoring
ASAP
owned
hung
three
live
disconnect
recommend
task
resubmit
STILL
attached
appropriate
created
works
University
location
worth
pertaining
Each
replace
newer
model
either
mail
carrier
reorder
meantime
offered
lost
Terrible
Finally
escalation
Issue
hasnt
Not
friendly
systems
Asked
remaining
mention
persons
lump
sum
Instead
apparently
FIRST
language
truly
repeat
fulfilled
thus
telephone
feedback
US
delays
XNAC
wonderful
enjoy
Gabriela
submit
Marvin
None
rebilling
accounting
shown
supplied
rather
tks
Mark
point
deemed
operation
waited
processes
free
Relations
Representative
Corporation
Street
updating
higher
ago
Extremely
outcome
additional
Xeroxcom
overnight
boxes
shipped
followed
tag
become
pursue
Smith
Printing
Office
Supply
Inc
Direct
Pay
USA
Cust
ability
gets
CARE
contacting
Serial
Inland
Color
note
THIS
IS
OF
PLEASE
CANCEL
ETCs
Since
nonexistent
direct
Every
jump
hoops
figure
certain
Yes
Was
ends
option
disappointing
notified
may
renew
lot
almost
wouldnt
hassle
bothered
half
automated
human
incredibly
reverse
yesterday
September
correcting
mistakes
minimum
discussed
An
Id
network
controller
looked
complete
survey
says
row
morning
happen
employee
reviewed
unused
package
shipment
Moving
Machine
Feb
Corp
unresolved
black
reversed
Silvia
short
performance
throughout
sensitive
gave
read
Santa
CA
Rocks
poorly
worded
unsure
whether
XEROX
Jane
Amazing
transferred
answered
recurring
spending
minutes
highly
helpdesk
fantastic
confusing
ie
How
emailing
start
October
FOUR
YEARS
letting
let
prints
Sergio
ended
wanted
irritated
Center
huge
Student
building
lots
offices
stores
CENTER
next
STUDENT
SUCCESS
delete
solving
sale
SN
inv
adjustment
redone
extended
retention
closing
CBR
production
product
replaced
acceptable
See
incident
emergency
toners
missing
expedited
premium
freight
NEVER
later
FedEx
compensate
They
investigation
driver
door
show
delivery
mind
manager
loss
MACHINE
eventually
hopefully
upon
delivered
somewhere
despite
explaining
including
absolute
disaster
refer
corporate
office
Amanda
required
On
top
errors
properly
tells
theres
responds
correspondence
ongoing
inaccurate
inadequate
gotten
discuss
appreciative
action
steps
Field
Tax
exemption
met
party
spot
documents
portion
entire
intentional
immediate
supervisor
fees
Erwin
Being
fourth
At
requirements
With
receiving
anymore
Weve
Who
documentation
Josseline
Moreno
ALL
mailing
exact
AGAIN
forwarding
generally
mark
Government
Agreement
initial
monthtomonth
resale
cert
Press
leaving
voicemail
surprised
consistently
training
Communication
Danielle
document
Dan
Gilland
FINANCIAL
Maybe
communicating
previously
FCU
billable
using
internal
cards
expectations
expect
del
ticket
remains
discrepancy
Lucia
showed
present
fill
form
computer
overall
probably
worst
knowing
setting
hang
window
Again
minimal
others
communicated
Well
Maria
realize
crediting
depts
debits
Jones
vendor
Most
printed
fighting
auto
replenishment
jams
stay
resold
wits
ones
box
enclosed
satisfaction
statement
earlier
agree
informed
link
occur
deleted
resent
certificate
along
New
lose
big
solve
desk
gentleman
Health
Dr
Ste
Martin
covered
software
shuffled
Software
consuming
St
Church
cell
confirmation
Havent
handles
established
satisfactory
timeframe
quicker
knowledgeable
directed
technical
honestly
directions
guy
general
na
Never
Fermin
ALEJANDRO
full
knowledge
completely
Estrada
forever
six
channel
Contract
approved
Rep
ASM
unaware
inspection
costing
departments
GREAT
CUSTOMER
SERVICE
Cook
LA
Dont
quoted
surveys
employees
quarterly
billings
quarter
experiences
cancelling
renewal
frame
disputing
purposes
NA
lack
expected
cycles
helping
adding
refused
proceed
aligned
MHL
Even
Many
anyway
These
irrelevant
happens
robot
speed
personal
challenging
trust
current
release
step
Jan
organization
books
exception
manual
ensure
meet
retrieve
attachment
text
scanned
promise
Let
Address
drum
wanting
true
repair
Rodriquez
interaction
center
referred
Tried
Hello
proof
coverage
value
distributor
advise
PM
Central
dissatisfied
Much
control
write
arrive
Rogers
arent
hopeful
confirming
word
incomplete
listed
university
responsible
normal
held
Lynn
definitely
MY
Baptist
added
seldom
efficiency
Because
edit
confirm
banking
ACH
shouldnt
Morris
Solutions
regards
Dallin
necessary
While
code
Fuji
AMOUNT
Only
inquires
Client
Manager
followup
types
November
overage
stayed
understood
navigate
ending
Anna
Its
Herrera
incurred
waived
filled
Vasquez
super
sad
standpoint
indicate
Yet
receives
replied
locations
spreadsheet
fashion
easier
Las
Vegas
visited
claimed
forth
Where
Ceasar
grateful
CTC
major
CMD
documented
instructed
From
Therefore
owed
courtesy
warrant
asap
faxes
tech
printers
reported
expense
Getting
things
sometimes
One
ship
Upload
questioned
total
inside
collections
AM
REFERRED
SOMEONE
ELSE
WHEN
WORKING
WAS
ridiculous
dec
Base
judgement
performed
lower
duplicate
Otherwise
represents
Garcia
listened
Kudos
operator
meeting
instrumental
contained
detailed
findings
Elena
chooses
divert
disputes
collection
unresponsive
chosen
outsource
third
ANY
denied
overcharges
except
remit
bank
guess
researching
Didnt
consider
Mario
HAVE
RESOLVE
AT
IT
SIMPLY
NAME
ON
BILL
Curtis
authority
listen
placing
XPPS
discussion
NP
Credits
What
Judith
Ceaser
Legal
Name
reflect
direction
engagement
forms
complex
simpler
realized
create
initially
professionalism
options
manage
engage
ways
learning
yes
impression
CSR
Thats
incredible
goes
units
records
SRs
Cindy
Unfortunately
totally
item
misunderstanding
staff
disconnected
signature
accept
sooner
Mary
expedite
assumed
reasons
lengthy
procedures
OUR
sold
Information
pages
TCs
Pages
backup
researched
Garnica
putting
low
resend
figured
estimated
HE
BILLING
Friday
messages
CALL
VERY
buyouts
following
locate
Ser
ser
timing
often
rental
assuming
Received
yearly
began
Colorado
likely
Ridiculous
LOTS
Elizabeth
Kevin
Return
site
alone
finds
tomorrow
constant
transfer
length
salesman
obtain
subsidiary
parent
Company
dialogue
notices
quite
particular
fairly
Kimberley
Grant
smooth
room
forced
glad
Texas
Austin
Department
Physics
related
Thelma
Salazar
BE
valuable
follows
Dear
Per
indicated
Betty
initiated
andor
WILL
extension
firm
Best
Glenn
Suchan
Sr
College
Natural
Sciences
Date
Lease
writing
expires
man
pleasant
specialist
larger
mails
course
basic
actions
updates
docucolor
track
download
spend
assign
balances
confusion
collectors
Alfredo
standard
waiver
assessed
assist
attentive
failed
Failed
dealers
DELL
corporation
train
success
Do
conclusion
Third
five
recd
Numbers
WE
disorganized
Lewan
Associates
Through
negative
rating
JOSE
Before
serviced
perfect
FLM
elevated
theyre
GIS
usage
Tech
noone
UK
suggested
decision
search
Had
field
remember
sell
cartridges
QUICK
TURNAROUND
GET
especially
Total
various
allowed
portal
HP
unsatisfactory
cleared
Ann
receipt
premises
Smart
somehow
Rhonda
knew
bringing
His
reasonable
toward
zip
Dunsmuir
MLS
products
Adriana
Martinez
quality
Fee
ahead
promptness
dissatisfaction
country
dollar
turned
nightmare
plan
entered
scheduled
refunded
unusable
supports
indicating
companys
unhappy
average
Down
worse
Outstanding
processing
separate
Follow
Up
Green
Space
upgraded
vendors
caught
difficulty
aware
meters
reflected
vs
Moore
Account
running
fortunate
dedicated
fire
court
force
stock
away
invoiced
downloaded
data
piece
hopes
escalated
accommodation
prevent
requirement
finding
Jocelyn
Especially
conference
counts
anywhere
Someone
USCustomer
Fantastic
Gary
saw
happening
felt
Bill
Horticulture
TX
source
front
chain
accounts
experienced
Everyone
specifically
Bracamonte
Canada
match
exchange
exchanged
connect
DAYS
saved
templetes
Promised
Actual
easily
four
worthless
relieved
Bani
sorting
ive
se
puede
el
la
para
tan
que
Karen
ups
completion
frustrated
angry
faxed
Rocky
NOTHING
LYNN
Lorena
Reseller
ME
devices
Kept
urgency
collect
busy
Always
rarely
transaction
Nelly
Francisco
matching
quarters
voicemails
Irma
Thomas
touch
HAD
CORRECT
KNOW
ANYTHING
invalid
revenue
BILLED
DATE
Laura
Barrera
government
accommodated
INVOICE
SO
prove
Coupa
usacustomercarexeroxcom
Portal
consideration
limit
history
voice
Hector
Completely
speaking
Pat
Quinn
Here
ReService
Type
FMV
paper
life
lifetime
warranty
honored
Reps
Satisfied
actual
Wofford
continually
entirely
Nope
Idaho
Water
Science
Secretary
USGS
commitment
situations
Scott
WOULD
PHONE
FROM
IN
MANAGEMENT
AS
Brenda
missed
RECEIVED
Absolutely
treated
companies
technicians
cases
impressions
usable
noticed
remain
MO
mile
DanielHerreraxeroxcom
Estuardo
Kathleen
partially
Take
side
fulfill
AFTER
IF
FOR
RESOLUTION
TOLD
SALES
REP
ADDRESS
confused
Poor
love
CONTACT
INK
MARKETPLACE
NEWEGG
ARE
UNDER
DONT
BACK
container
Mancil
leased
Xeroxs
erroneous
withdrawn
odd
named
picks
constantly
painful
collector
cumbersome
conflicting
opened
attempt
Despite
inquired
section
subsequent
SUPER
statements
Disappointed
calculations
dissolve
comes
nature
explanations
Late
woman
geographic
Emailed
contracted
NUMBER
terrific
buildings
Burnet
Like
Though
scheduling
tracking
registered
Control
NE
unfortunately
Are
dozen
Foreign
tests
DO
initiate
Ricardo
upfront
NJ
Wish
recorded
nope
WHAT
Allain
informing
bought
Awesome
attempting
supposedly
clarifications
Associate
pending
runaround
satisfecha
un
servicio
ha
los
por
equipo
más
esperando
equipos
American
verification
Hinners
RMA
asset
States
BETZABE
MARISOL
PINEDA
AVILA
stupid
fro
Pykel
UTi
Should
bounced
possibly
self
break
tree
escalate
appointment
funds
complain
solutions
agents
California
assume
outside
filed
Quick
Vickys
led
Give
teams
lying
ONLY
Duplo
Either
EVEN
LATE
ONE
overbilled
Called
NONE
whatever
neglect
AN
clean
THEY
Cobham
kindly
GREATLY
minute
materials
Howard
application
verify
indeed
Read
Prev
TOTAL
IMPRESS
TIME
FUSER
INCLUDED
METERED
SUPPLY
CUSTOMERS
frequency
content
Jacksonville
Corina
reopen
contacts
labor
managers
hearing
mailbox
Tiggs
holding
square
TAKEN
SINCE
anticipated
Finance
Director
Lewisville
BEST
ANYONE
dumped
perception
Marizabel
carrying
determination
maintenace
Sarasota
forgiven
stuff
Welcome
Time
eInvoicing
User
enter
Pamela
Web
pool
Atlas
blamed
misspell
example
Seattle
WA
Jeanine
Hancock
Summit
Circle
Clarita
United
Method
Payment
constraint
Exempt
Durbin
shop
Agent
spelt
consumables