requested
instructions
Xerox
provide
customer
needs
return
unused
supplies
received
email
back
template
updated
Customer
Care
representative
Lynne
Jones
awesome
pushed
another
rep
unable
get
Also
dont
know
name
Mary
came
one
business
never
bill
high
tried
reach
Carlos
phone
least
time
via
respond
Great
follow
knowledge
Return
little
bit
done
went
beyond
thank
Hector
worked
close
years
The
difficulty
company
experiences
like
gentleman
wonder
working
Dont
sure
yet
quoted
price
buyout
told
different
sent
check
first
see
resolved
reached
detailed
call
log
communications
service
department
notified
listed
records
show
documented
calls
end
Please
advise
possible
Marizabel
took
ownership
right
away
case
priority
Really
appreciated
really
appreciate
got
completed
ASAP
Thank
heard
anyone
Still
waiting
hear
handles
matter
This
resolve
issue
emails
receiving
confirmation
conversation
hasnt
even
established
However
contact
Grant
think
since
December
trying
situation
Ms
excellent
job
appeared
authority
make
necessary
adjustments
account
She
immediately
If
credit
applied
open
balance
Having
sit
hold
speak
order
request
refund
big
inconvenience
takes
day
We
issued
memo
invoices
paid
full
It
everytime
representatives
professional
friendly
communication
offered
poorly
worded
unsure
whether
XEROX
picking
package
Glad
many
months
billed
times
maintenance
charge
Initially
believe
addressed
correctly
Your
contacted
made
screen
shot
changes
assure
correct
Very
happy
effort
still
Coupa
form
contained
Ive
usacustomercarexeroxcom
review
click
link
register
update
serial
number
new
Would
faster
turn
around
submitting
requests
Jose
David
great
No
Im
taken
horrible
way
dealing
lady
dealt
nice
owe
money
copiers
sitting
hallway
almost
That
wouldnt
pick
hassle
come
questions
please
bothered
far
able
remedy
wrong
Our
called
Financial
Information
Management
Student
Government
want
always
issues
Quick
polite
pleasant
helpful
asked
removed
appearing
mail
per
Explanation
although
needed
understood
awhile
Communication
timely
Via
actually
Invoice
contacts
physical
addresses
supposed
changed
recent
belong
Job
Sergio
efficient
process
much
longer
expected
feel
best
expedite
resolution
disputed
late
passed
someone
else
cant
unnecessary
fee
feeling
multiple
people
Otherwise
quickly
My
shipping
address
Way
Ave
metered
outstanding
regarding
tool
taking
long
adjustment
invoice
however
rebill
meters
dates
billing
lease
cancel
date
access
site
says
updates
added
appear
provided
saying
enough
information
started
informed
dealer
material
online
They
ordered
us
Though
explained
sounded
though
error
Not
January
year
unit
At
located
installed
October
California
Texas
fast
Thanks
quick
need
inquiry
record
response
looking
could
source
transactions
occurred
states
Well
concern
responded
say
past
reason
payment
plan
entered
agreement
pay
payments
understanding
going
forth
would
scheduled
without
fees
month
regular
current
next
five
last
Received
copies
days
specialist
office
telephone
instructed
two
card
file
additional
therefore
making
larger
Requested
copy
signed
receive
James
helping
Lisa
Curtis
definitely
gets
manual
deserves
dec
bad
paying
bills
thought
might
due
individual
spoke
broken
let
finally
fixed
left
parts
incorrect
probably
idea
Although
discussions
various
glad
push
insist
Once
fine
ticket
research
forward
dept
charges
Jacksonville
Sandra
location
incident
replied
Corina
advised
researched
FL
Rocky
correspondence
reopen
LYNN
IS
THANK
YOU
help
getting
systems
fixing
soon
may
confused
Inquiry
indicating
also
wanted
legal
OneTouchPoint
Bill
assistance
change
reflect
Dr
WI
old
Company
Green
machine
moved
FSMA
go
New
sheet
Name
neither
apply
system
Fantastic
turnaround
delivered
promised
For
simple
task
using
refunded
neglect
written
agreements
notice
contract
continued
sending
monthly
statements
keep
promptly
local
dealers
realized
already
expired
After
twice
ask
onsite
coming
fault
sad
give
corporation
guys
arent
ever
xerox
others
collection
Poor
You
love
game
problem
note
generated
invoicing
input
dated
initial
covered
matching
Since
three
credits
debits
internally
taxes
starting
relieved
grateful
remove
ended
creating
real
work
Corp
unresolved
black
color
reversed
See
stated
Morales
forwarded
reply
responsible
person
today
overall
pretty
good
support
team
resolutions
missing
backup
Always
group
particular
inquired
compared
previous
inquires
reaching
nothing
things
inquiries
communicating
something
ups
Address
spelling
list
following
Foxborough
Human
Services
Central
Street
said
November
talked
happened
count
July
September
August
So
take
estimated
overage
Rep
Serial
Read
Date
claim
Prev
TOTAL
IMPRESS
showing
handle
pickup
processed
gave
read
NOT
Santa
CA
Sales
solving
providing
sale
sales
copier
SN
PO
June
picked
inv
Weve
ones
correction
aging
shop
UPS
delivery
reorder
toner
arrived
later
understand
customers
reasonable
explanation
Its
ignored
explain
gotten
behind
gentlemen
named
suppose
removal
When
kept
giving
answer
supervisor
basically
tell
thing
round
except
accurate
automated
messages
personal
reasons
renew
exist
corrected
final
prompt
remaining
rent
term
There
mention
wish
purchase
As
persons
lump
sum
Instead
offer
apparently
prefer
simply
store
comments
Marvin
courteous
small
treatment
clear
telling
whole
building
agents
poor
cannot
prove
proof
avail
satisfaction
pleasure
employees
consideration
unhappy
Much
less
likely
contracts
indicated
doesnt
Just
notes
placed
closed
And
happens
care
assist
requesting
try
attention
part
knew
reps
survey
extra
departments
Good
prepared
requirements
accurately
question
ext
assured
Then
asking
meter
reads
Get
act
together
stop
hoping
wont
paperwork
send
guessing
hope
Lisas
thorough
lost
didnt
normally
original
Issue
thanks
somewhat
disappointed
resolving
fashion
prior
impressed
Javier
well
collector
reverse
valid
quite
length
machines
future
must
ok
several
Now
handled
Give
BETZABE
MARISOL
PINEDA
AVILA
raise
expectations
seemed
policies
prevented
within
acceptable
frame
weeks
unacceptable
world
available
difficult
Could
status
printer
Carol
fax
felt
What
hell
staples
returned
exchange
worth
exchanged
wasnt
waste
Excellent
Service
include
pricing
agent
cost
recd
results
Managed
logged
Request
Numbers
attached
spreadsheet
contacting
completely
anything
disappointing
resulting
move
usage
emailed
responding
put
Supplies
required
extremely
timeconsuming
easier
Representative
frequency
content
clearly
rate
extent
Upon
reading
message
readings
adjusted
quarterly
billings
rather
followed
concerned
paper
pull
isnt
important
thats
He
Issues
pending
responsive
concerns
appropriate
level
rating
Mancil
May
moving
everything
thoroughly
Christmas
frustrating
base
initially
option
confirmed
auto
submitted
confirm
faxed
given
NP
ongoing
spent
hours
attempting
amount
meant
manager
Support
worst
average
realize
Las
Vegas
Only
companys
Down
April
talking
Guam
American
angry
talk
labor
closure
notification
included
needing
In
addition
Department
nobody
answers
seems
stating
devices
Seems
surprised
complete
vendor
unaware
lack
redirected
downtime
PHONE
NUMBER
CN
none
None
Actual
clicks
used
turned
actual
Trying
banking
ACH
info
everyone
details
cleared
Ann
receipt
premises
responsibility
works
Smart
Document
Solutions
clue
First
documents
manner
handling
Susan
NOTHING
WAS
cartridges
properly
equipment
spelled
Took
units
serviced
cancelled
submission
Allan
asap
perfectly
Jane
Id
automatically
pleased
hour
quote
waited
directed
satisfactory
Jennifer
look
ago
drum
find
tells
search
somewhere
download
print
buy
party
install
mailed
NO
Number
replace
Business
incorrectly
Ship
ToInstall
street
registered
state
Most
problems
thru
Elena
clarifications
resale
cert
leaving
voicemail
throughout
amortization
schedule
costs
settlement
clarify
period
value
prepaid
couldnt
letter
expire
continue
program
create
experienced
type
newer
model
fortunate
Rodriquez
recommend
Rogers
Pay
Even
directly
CSR
figured
complain
letting
terms
contracted
standard
WOULD
TO
HAVE
THE
LATE
CHARGE
SINCE
THIS
TIME
WE
BEEN
WITH
calculations
patient
CTC
major
CMD
forwarding
fix
trained
Nothing
havent
means
Was
inform
How
emailing
whats
second
Credits
funding
assessed
place
prevent
Jocelyn
DID
GREAT
happen
quicker
tax
charged
Daniel
moment
Monday
IT
Yet
indicate
feedback
expect
direct
third
seem
closing
SR
geographic
resources
waived
initiate
JOSE
spoken
reference
Ricardo
assigned
either
All
dealings
steps
internal
delays
piece
gear
White
Rd
San
claimed
week
decision
malfunction
document
home
printed
PostScript
Administration
enable
device
sheets
causes
huge
maybe
buyouts
ridiculous
approx
frequently
repairs
tracking
lots
Lots
loss
associated
learned
live
English
accent
WILL
HER
morning
shows
solve
CUSTOMER
SERVICE
AFTER
MY
VERY
BE
CALL
IF
FOR
IN
THERE
RESOLUTION
SALES
REP
ADDRESS
ISSUE
AM
PROBLEM
HAS
RESOLVED
ONLY
SITUATION
THAT
MS
RODRIGUEZ
AT
ALL
TIMES
BUT
OF
AGREEMENT
AND
ANY
ON
HOLD
AN
HOUR
WHAT
HAPPENED
ME
MORE
THAN
PERSON
EVER
FROM
LATER
STILL
WAITING
INVOICES
LEAST
COURTESY
RESPONSES
RECEIVED
WERE
AUTOMATIC
DATES
PROVIDED
REALLY
every
documentation
updating
Account
Suite
Seattle
WA
Sarah
Specialist
Inc
upset
followup
indeed
frustrated
point
FIRST
YEARS
WORKING
BILLED
FUSER
WHEN
INCLUDED
METERED
SUPPLY
CUSTOMERS
tech
Either
awaiting
addressing
FOUR
instrumental
actions
Her
tks
urgent
proper
reviewed
dispute
With
numerous
findings
revised
amazing
referred
shouldnt
early
termination
unusable
techs
repair
numbers
Too
tape
determine
confusing
Christian
Everything
smoothly
Barbara
Lang
skills
receives
experience
encountered
replies
quickest
based
possibly
thankful
fact
Basically
mind
noticed
Jan
evidence
brush
exceeded
Late
Charges
upsetting
anybody
general
mails
voice
mistake
result
valuable
data
truly
whenever
hard
wait
forever
cut
six
mine
Disappointed
knowledgeable
Image
To
associate
III
action
supposedly
WHERE
AWESOME
Luisa
terrific
Cesar
Mario
Moreira
Billing
repeating
Where
quarters
ie
etc
cancellation
free
Oh
cheaper
returning
NEVER
constantly
breaking
WORST
industry
attempt
validated
seen
exact
cancelling
Asked
technician
shipped
room
forced
March
gone
sign
direction
informative
often
rental
assuming
complaint
printers
totally
suite
specific
POs
supply
respect
goes
subject
practices
cause
active
de
cleaning
standing
mess
settled
makes
Wofford
regards
Totally
unresponsive
Who
main
set
setting
nope
beginning
stupid
College
Gabriella
interaction
waiving
But
kind
authorized
report
prints
Closing
start
State
fully
clarification
resubmit
use
product
expires
vendors
overbilled
Called
discuss
Unfortunately
Francisco
mandatory
unfair
verification
leases
attempts
spend
created
Agent
release
agency
upon
owner
dedicated
staff
surveys
certificate
Office
SO
fairly
Everyone
wants
pass
willing
discussed
Center
Ashley
usually
escalate
couple
management
Elizabeth
Kathy
helped
approved
exception
credited
REFERRED
SOMEONE
ELSE
responses
signatures
irrelevant
putting
blanks
requires
provides
detail
Keep
satisfied
four
including
answered
fire
downloaded
Third
met
keeps
church
remain
MO
Baptist
Church
Attn
meantime
shipment
Sincerely
Corporation
negative
TCs
expiring
considering
autopay
claiming
adjust
Smith
Printing
Supply
Direct
USA
chooses
divert
disputes
processes
chosen
outsource
denied
Tried
sense
urgency
Getting
sometimes
One
ship
story
write
yes
hate
giant
remains
recall
TWICE
employee
Moving
Machine
Feb
Thelma
copying
better
rest
Jossy
interest
finding
Fermin
appears
failed
shown
duplicate
nearly
impossible
run
Second
confidence
AP
absolutely
ran
decided
line
EXACT
gain
obviously
greatly
appreciative
easy
wonderful
Super
automatic
Black
large
Meeting
Toner
Automatic
shuffled
center
Every
separation
Client
Manager
Person
area
Especially
specifically
types
deal
especially
knows
passing
buck
instead
wasting
lot
meet
halfway
Ricoh
Innovations
guy
Before
smooth
perfect
anymore
Can
emergency
timing
saved
Awesome
Again
remember
Lynn
nightmare
Tiggs
bought
unhelpful
Xeroxs
top
meeting
figure
managers
manage
Thats
promise
door
Mr
Have
tests
structure
DO
RMA
client
items
Maybe
court
listen
Vasquez
operational
charging
relationship
dollars
zero
ordering
allow
Shipping
owned
subsidiary
parent
website
looked
Fee
Ill
perhaps
Mark
operation
engaged
managed
services
informing
item
misunderstanding
theres
mentioned
visited
refused
advance
copied
carrier
authorization
label
driver
minutes
goal
remit
statement
along
Sometimes
delay
Never
seeking
ends
procedure
mean
efficiently
attentive
filled
communicate
Amiee
responds
professionalism
Blake
Jilsen
thus
communicated
explaining
Promised
exempt
ahead
asset
submit
regard
Both
code
reflected
Sharon
caught
assumed
PAST
DUE
Why
school
mailing
terrible
step
directions
successful
writing
Administrative
NEED
Purchase
Order
delete
Joanne
names
noted
stayed
bounced
training
prioritizing
escalation
Horticulture
BILL
TX
ETCs
effectively
Guatemala
Outstanding
rude
transferred
Finally
ensure
Ericka
accepted
resend
Tech
Silvia
Lease
materials
upgraded
renewing
container
replenish
busy
University
renewals
renewal
deals
separate
looks
ReService
Dear
Form
Type
loop
rarely
nature
Problem
resubmitted
yesterday
Maria
certain
incredible
sorting
fulfilled
February
unwilling
spending
Herrera
DanielHerreraxeroxcom
collections
caused
Zamora
consuming
worthless
upgrade
earlier
HP
Contract
unsatisfactory
negotiated
locate
dozen
transfer
Danielle
Group
disputing
Cheryll
processing
Absolutely
language
repeat
US
On
Josseline
Moreno
AGAIN
excel
format
currently
organization
track
Cindy
complex
recorded
showed
bank
pertaining
Each
alone
special
age
locations
boxes
transaction
These
frustration
extreme
known
outcome
originally
Stephanie
Cust
Ser
mistakes
errors
Colorado
Amanda
replaced
knowing
accounting
impact
eventually
short
painful
network
controller
Today
row
Is
load
timeframe
Reps
limit
hence
waive
comment
owed
erroneous
Do
hand
software
cover
St
cell
opened
mailbox
NA
section
solved
mixed
speedy
potential
half
Juan
Puerto
Rico
Rodriguez
calling
hung
Quickest
noone
SRs
concerning
wanting
PLEASE
GET
INVOICE
displayed
rejected
City
require
recurring
missed
Lucia
professionally
solution
discontinued
discrepancy
continually
resent
worse
invalid
revenue
expiration
DISPUTING
Laura
Barrera
law
government
extended
NAME
AR
LIST
involved
finds
tomorrow
patience
slow
ending
Let
control
situations
assignment
Cristian
Guerra
Navarijo
checking
Ana
ANA
stock
defective
proceed
portion
entire
intentional
disconnect
immediate
found
amounts
Over
course
university
placing
Apparently
blank
brought
GIS
forms
fill
EVEN
OUR
ONE
challenging
delayed
allowed
basic
related
helpfulness
quarter
quality
signature
States
Appreciate
effective
Extremely
Nice
man
sends
circles
engage
JOB
invoiced
otherwise
ways
wasted
consistently
An
setup
Going
tired
ive
questioned
procedures
Peggy
somebody
Lorena
preferred
aligned
pursue
Overall
positive
Manuel
County
matched
Provided
acknowledge
represents
Yes
aware
technical
relatively
feet
unprofessional
ready
Procurement
understands
extend
regardless
Officer
MANAGEMENT
RESOLVE
AS
Brenda
waiver
treated
companies
afternoon
Will
subsequent
supporting
Dallin
Obviously
Canada
match
confusion
Lewan
Associates
corrections
hoops
escalated
accommodation
books
fiscal
requirement
FIX
text
Tax
hopes
scheduling
notifying
stopped
PM
Receiving
Invoices
Completely
arrive
deliver
Estuardo
Kathleen
initiated
partially
prioritized
standpoint
Nov
Been
ability
FIXED
onto
Be
obvious
anticipated
leave
consumables
unsatisfied
switching
By
lacking
DAYS
Ridiculous
templetes
Being
fourth
Anna
balances
collectors
hang
Friday
abandoned
disorganized
minimum
easily
hearing
word
facility
sold
speed
RESPONSE
Inland
CANCEL
Best
Dan
higher
se
puede
el
overnight
feed
chance
WorkCentre
changing
Gabriela
bringing
sort
clients
internet
UK
suggested
front
constant
accounts
guess
Kevin
Need
Moore
super
trust
lying
Campbell
generally
endless
While
FLM
elevated
Included
notices
purchased
notify
total
window
corporate
LOTS
beforehand
promptness
retention
CBR
debit
recieved
Canadian
self
computer
misspell
sound
example
THEY
previously
attachment
Evelin
Accounts
AGUILAR
Rhodes
Pharmaceuticals
continues
questioning
sell
sensitive
parties
Durbin
individuals
Ronal
saw
odd
method
assume
Nope
obtain
Satisfied
correcting
Morris
annual
School
basis
damaged
serious
Hall
outside
Austin
Physics
Salazar
space
follows
Per
renewed
andor
formally
accept
extension
monthtomonth
Glenn
Suchan
Sr
Natural
Sciences
From
database
Fuji
Many
Base
Charge
Regarding
Fisher
Paul
Burke
Regards
minute
summary
Had
Idaho
Water
Science
USGS
Phone
Fax
determined
hopefully
replacement
products
Erwin
add
Closure
Notification
Another
finished
consider
Agreement
dollar
withdrawn
Therefore
performance
National
Park
connected
began
Bani
indicative
weve
white
connection
trouble
exasperated
judgement
box
mark
buildings
offices
Burnet
cases
field
Did
lines
awful
Failed
Major
Pykel
UTi
Should
fit
hopeful
marketing
hotline
performed
page
assisting
Somehow
researching
Without
YOUR
Cobham
kindly
GREATLY
PLEASANT
opinion
combined
sourcing
reliability
alternatives
uptime
massive
enjoy
DELL
success
indication
CENTER
RM
STUDENT
SUCCESS
Format
salesman
entirely
Space
Sent
vacation
eight
seven
fro
Internal
words
billion
Candice
Griffin
Perry
true
Items
CNTY
Adriana
Paiz
blamed
upfront
NJ
size
electronic
limited
Jeanine
Hancock
Summit
Circle
Total
High
Item
Clarita
United
Method
Payment
Plano
Senior
Denitech
Joe
orders
lingering
constraint
Finance
accomplished
forgiven
portal
spelt
clean
lengthy
Dunsmuir
MLS